DataProcessors/ВходящийЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ВходящийЗвонок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/МобилонВариантыОтображенияИнформацииОВходящем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>МобилонВариантыОтображенияИнформацииОВходящем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Форма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ВходящийЗвонок/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьПоиск()
				
	Объект.Контрагент = ВАТССервер.НайтиОбъектПоНомеруТелефона(Объект.СНомера).Партнер;
	Элементы.КнопкаКонтрагент.Заголовок = Объект.Контрагент;
		
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Контр		= Символы.ПС + Символы.ПС + "Контрагент:" + Объект.Контрагент;		
		НавСсылка	= ПолучитьНавигационнуюСсылку(Объект.Контрагент);
	Иначе
		Контр		= "";
		НавСсылка	= Неопределено;
	КонецЕсли;
	Если ВАТССервер.ПолучитьЗначениеПараметра(ВАТССервер.ВернутьТекущегоПользователя(), "ПоказыватьВсплывающиеУведомленияПриЗвонках") Тогда
		ПоказатьОповещениеПользователя("Входящий", НавСсылка, "От " + Объект.СНомера + Контр, ,СтатусОповещенияПользователя.Информация);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВариантОтображенияИнформацииОВходящем()

	Возврат Справочники.ВАТСКонстанты.ПолучитьЗначение("ВариантОтображенияИнформацииОВходящем");

КонецФункции // ()

&НаКлиенте
Процедура ОткрытьКонтрагента()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОткрытьЗначение(Объект.Контрагент);
	Иначе 
		Форма = ПолучитьФорму("Справочник.Партнеры.Форма.ПомощникНового");
		Форма.ТелефонПартнера = Объект.СНомера;
		Форма.ТелефонПартнераЗначенияПолей = ВернутьЗначениеПолей(Объект.СНомера);
		Форма.Открыть();		
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.СНомера) Тогда
		ВыполнитьПоиск();
	КонецЕсли;	
	
	Если ПолучитьВариантОтображенияИнформацииОВходящем() = ПредопределенноеЗначение("Перечисление.МобилонВариантыОтображенияИнформацииОВходящем.Контрагент") 
	Тогда
		ОткрытьКонтрагента();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьЗначениеПолей(СНомера)
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СНомера, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));	
	
КонецФункции


&НаКлиенте
Процедура Контрагент(Команда)
	
	ОткрытьКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьМобилон(Команда)
	
	ВАТССервер.Позвонить(Объект.СНомера);
	
КонецПроцедуры
